In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy import nan

In [9]:
data = Series(['one','two',nan,'four'])

In [10]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [11]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [12]:
data2 = Series(['one','two',None,'four'])
data2

0     one
1     two
2    None
3    four
dtype: object

In [13]:
data2.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [14]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [15]:
data2.dropna()

0     one
1     two
3    four
dtype: object

In [16]:
df = DataFrame([[1,2,3], [nan,5,6], [7,nan,9],[nan,nan,nan]])
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [17]:
df.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [18]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [19]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [20]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [21]:
df2 = DataFrame([[1,2,3,nan],[2,nan,5,6],[nan,7,nan,9],[1,nan,nan,nan]])
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [23]:
df.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [24]:
df.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [25]:
df2.fillna(42)

      0     1     2     3
0   1.0   2.0   3.0  42.0
1   2.0  42.0   5.0   6.0
2  42.0   7.0  42.0   9.0
3   1.0  42.0  42.0  42.0

In [26]:
df2.fillna({0:100, 1:200, 2:300, 3:400})

       0      1      2      3
0    1.0    2.0    3.0  400.0
1    2.0  200.0    5.0    6.0
2  100.0    7.0  300.0    9.0
3    1.0  200.0  300.0  400.0

In [27]:
df2.fillna(-1, inplace=True)

In [28]:
df2

     0    1    2    3
0  1.0  2.0  3.0 -1.0
1  2.0 -1.0  5.0  6.0
2 -1.0  7.0 -1.0  9.0
3  1.0 -1.0 -1.0 -1.0